Revit 2027 API
FilteredWorksetCollector.GetWorksetIterator Method
 Returns a FilteredWorksetIterator to the worksets passing the current filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FilteredWorksetIterator GetWorksetIterator()
Public Function GetWorksetIterator As FilteredWorksetIterator
public:
FilteredWorksetIterator^ GetWorksetIterator()
member GetWorksetIterator : unit -> FilteredWorksetIterator
Return Value
FilteredWorksetIterator
Remarks
 Calling this when you have an active iterator to this same collector will result in the first iterator being stopped by this call.
See Also
Reference
FilteredWorksetCollector Class
Autodesk.Revit.DB Namespace